/*
ㅇ Node.js를 왜 배워야 하는가?
React.js, Next.js, Vue.js Svelte 등등 모두 Node.js 를 기반으로 하는 언어들이기 때문이다.

Node.js는 웹 브라우저가 아닌 환경에서도 자바스크립트 코드를 실행시켜주는 자바스크립트의 실행 환경(Runtime)이다.
* 런타임 = 구동기. 마치 플레이스테이션이 게임을 구동시키듯이.

Node.js는 크롬 V8 자바스크립트 엔진으로 빌드된 자바스크립트 런타임이다.


ㅇ Node.js는 왜 만들어졌을까?
자바스크립트는 웹 페이지 내부에 필요한 아주 단순한 기능만을 개발하기 위해 만들어졌다.
그런데 매우 유연하고 생산성이 좋게 만들어져서 개발자들이 웹 브라우저 밖에서도 사용하고 싶어하는 니즈가 생겼다.
이러한 배경으로 2009년 Node.js가 탄생하였고 자바스크립트로는 할수 없었던 웹 서버, 모바일 앱, 데스크톱 앱 개발이 가능해졌다.

ㅇ결국 Node.js 는..
웹 페이지 내에서 단순하게만 이용되던 자바스크립트를 범용적으로 이용할수 있도록 만든 자바스크립트 런타임(실행환경)이다.
*/
